Documents/упПеремещениеМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упПеремещениеМатериалов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.упОстаткиМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСклады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСклады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГСМ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГСМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Запчасти</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Запчасть</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упЗапчасти</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/упПеремещениеМатериалов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Нет.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

// Заполнение дополнительных свойств документа.
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	упГСМ.ГСМ КАК Материал,
	|	СУММА(упГСМ.Количество) КАК Количество
	|ПОМЕСТИТЬ втМатериалы
	|ИЗ
	|	Документ.упПеремещениеМатериалов.ГСМ КАК упГСМ
	|ГДЕ
	|	упГСМ.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	упГСМ.ГСМ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	упЗапчасти.Запчасть,
	|	СУММА(упЗапчасти.Количество)
	|ИЗ
	|	Документ.упПеремещениеМатериалов.Запчасти КАК упЗапчасти
	|ГДЕ
	|	упЗапчасти.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	упЗапчасти.Запчасть
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упПеремещениеМатериалов.СкладОтправитель КАК Склад,
	|	втМатериалы.Материал,
	|	втМатериалы.Количество
	|ИЗ
	|	втМатериалы КАК втМатериалы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упПеремещениеМатериалов КАК упПеремещениеМатериалов
	|		ПО (упПеремещениеМатериалов.Ссылка = &Ссылка)";
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		ДополнительныеСвойства.Вставить("ОстаткиМатериалов", Результат.Выгрузить());
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
